package neighbors.enums;

import java.util.Set;

public class DistrictEnum {

    public final static Set<String> districts = Set.of(
            "академический", "алексеевский", "алтуфьевский", "арбат", "аэропорт",
            "бабушкинский", "басманный", "беговой", "бескудниковский", "бибирево",
            "бирюлёво восточное", "бирюлёво западное", "богородское", "братеево",
            "бутово северное", "бутово южное", "бутырский", "вешняки",
            "внуково", "войковский", "восточный", "выхино-жулебино", "гагаринский",
            "головинский", "гольяново", "даниловский", "дегунино восточное", "дегунино западное",
            "дмитровский", "донской", "дорогомилово", "замоскворечье",
            "зюзино", "зябликово", "ивановское", "измайлово восточное", "измайлово",
            "измайлово северное", "капотня", "коньково", "коптево", "косино-ухтомский",
            "котловка", "красносельский", "крылатское", "крюково", "кузьминки",
            "кунцево", "куркино", "левобережный", "лефортово", "лианозово", "ломоносовский",
            "лосиноостровский", "люблино", "марфино", "марьина роща", "марьино",
            "матушкино", "медведково северное", "медведково южное", "метрогородок",
            "мещанский", "митино", "можайский", "молжаниновский", "москворечье-сабурово",
            "нагатино-садовники", "нагатинский затон", "нагорный", "некрасовка",
            "нижегородский", "ново-переделкино", "новогиреево", "новокосино",
            "обручевский", "орехово-борисово северное", "орехово-борисово южное",
            "останкинский", "отрадное", "очаково-матвеевское", "перово", "печатники",
            "покровское-стрешнево", "преображенское", "пресненский", "проспект вернадского",
            "раменки", "ростокино", "рязанский", "савёлки", "савёловский", "свиблово",
            "северный", "силино", "сокол", "соколиная гора", "сокольники", "солнцево",
            "старое крюково", "строгино", "таганский", "тверской", "текстильщики", "тёплый стан",
            "тимирязевский", "тропарёво-никулино", "тушино северное", "тушино южное",
            "филёвский парк", "фили-давыдково", "хамовники", "ховрино", "хорошёво-мневники",
            "хорошёвский", "царицыно", "черёмушки", "чертаново", "щукино", "южнопортовый",
            "якиманка", "ярославский", "ясенево"
    );
}
